# Lab Report 7: Database Queries
## Name: Afnan Alabdulwahab

### Problem 0
Import the following libraries, load the `.env` file where you store your passwords (see the notebook for module 4 for details), and turn off the error tracebacks to make errors easier to read:

In [76]:
import numpy as np
import pandas as pd
import sys
import os
import requests
import psycopg
import pymongo
import json
from bson.json_util import dumps, loads
from sqlalchemy import create_engine
import dotenv

# change to the directory where your .env file is
os.chdir("/Users/afnan/Documents/DS6001/databases/ds6001databases") 

dotenv.load_dotenv() # register the .env file where passwords are stored
sys.tracebacklimit = 0 # turn off the error tracebacks

### Problem 1
For this problem, we will be building a PostgreSQL database that contains the collected works of Shakespeare.

<img src="https://www.chappatte.com/prod/wp-content/uploads/artworks/2016/04/L160423ge-950x635.jpg" width="300">

The data were collected by [Catherine Devlin](https://github.com/catherinedevlin/opensourceshakespeare) from the repository at https://opensourceshakespeare.org/. The database will have four tables, one representing works by Shakespeare, one for characters that appear in Shakespeare's plays, one for chapters (this is, scenes within acts), and one for paragraphs (that is, lines of dialogue). The data to populate these four tables are here:

In [77]:
works = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Works.csv")
characters = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Characters.csv")
chapters = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Chapters.csv")
paragraphs = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Paragraphs.csv")

In PostgreSQL, it is best practice to convert all column names to lower-case, as case sensitive column names will require [extraneous double-quotes](https://stackoverflow.com/questions/20878932/are-postgresql-column-names-case-sensitive) in any query. We first convert the column names in all four dataframe to lowercase:

In [78]:
works.columns = works.columns.str.lower()
characters.columns = characters.columns.str.lower()
chapters.columns = chapters.columns.str.lower()
paragraphs.columns = paragraphs.columns.str.lower()

You will build a database and populate it with these data. The ER diagram for the database is:

<img src="https://github.com/jkropko/DS-6001/raw/master/localimages/shakespeare2.png" width="400">

There's no codebook, unfortunately, but the values in the columns are mostly self-explanatory:

In [79]:
works.head()

,workid,title,longtitle,date,genretype,notes,source,totalwords,totalparagraphs
0,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,NaN,Moby,19837,1031
1,allswell,All's Well That Ends Well,All's Well That Ends Well,1602,c,NaN,Moby,22997,1025
2,antonycleo,Antony and Cleopatra,Antony and Cleopatra,1606,t,NaN,Moby,24905,1344
3,asyoulikeit,As You Like It,As You Like It,1599,c,NaN,Gutenberg,21690,872
4,comedyerrors,Comedy of Errors,The Comedy of Errors,1589,c,NaN,Moby,14692,661

In [80]:
characters.head()

,charid,charname,abbrev,works,description,speechcount
0,1apparition-mac,First Apparition,First Apparition,macbeth,NaN,1.0
1,1citizen,First Citizen,First Citizen,romeojuliet,NaN,3.0
2,1conspirator,First Conspirator,First Conspirator,coriolanus,NaN,3.0
3,1gentleman-oth,First Gentleman,First Gentleman,othello,NaN,1.0
4,1goth,First Goth,First Goth,titus,NaN,4.0

In [81]:
chapters.head()

    workid  chapterid  section  chapter            description
0  12night    18704.0      1.0      1.0  DUKE ORSINO's palace.
1  12night    18705.0      1.0      2.0         The sea-coast.
2  12night    18706.0      1.0      3.0        OLIVIA'S house.
3  12night    18707.0      1.0      4.0  DUKE ORSINO's palace.
4  12night    18708.0      1.0      5.0        OLIVIA'S house.

In [82]:
paragraphs.head()

,workid,paragraphid,paragraphnum,charid,plaintext,phonetictext,stemtext,paragraphtype,section,chapter,charcount,wordcount
0,12night,630863,3,xxx,"[Enter DUKE ORSINO, CURIO, and other Lords; Mu...",ENTR TK ORSN KR ANT O0R LRTS MSXNS ATNTNK,enter duke orsino curio and other lord musicia...,b,1.0,1.0,65.0,9.0
1,12night,630864,4,ORSINO,"If music be the food of love, play on;\n[p]Giv...",IF MSK B 0 FT OF LF PL ON JF M EKSSS OF IT 0T ...,if music be the food of love plai on give me e...,b,1.0,1.0,646.0,114.0
2,12night,630865,19,CURIO,"Will you go hunt, my lord?\n",WL Y K HNT M LRT,will you go hunt my lord,b,1.0,1.0,27.0,6.0
3,12night,630866,20,ORSINO,"What, Curio?\n",HT KR,what curio,b,1.0,1.0,13.0,2.0
4,12night,630867,21,CURIO,The hart.\n,0 HRT,the hart,b,1.0,1.0,10.0,2.0

#### Part a
Connect to your local PostgreSQL server (take steps to hide your password!), create a new database for the Shakespeare data, use `create_engine()` from `sqlalchemy` to connect to the database, and create the works, characters, chapters, and paragraphs tables populated with the data from the four dataframes shown above. [2 points]

First, I ensure that my PostgreSQL password is loaded securely using the dotenv package.

In [83]:
dotenv.load_dotenv()
postgres_password = os.getenv('POSTGRES_PASSWORD')

Next, I establish a connection to the local PostgreSQL server using the psycopg library. The connection parameters include the user, password, host, and port. I also enable autocommit to immediately apply my changes.

In [84]:
# Connect to postgres server
dbserver = psycopg.connect(
    user = 'postgres',
    password = postgres_password,
    host = 'localhost',
    port = '5432'
)
dbserver.autocommit = True

With the server connection established, I use a cursor to execute SQL commands for creating a new database named "shakespeare." If the database already exists, I drop it first to ensure a clean setup.

In [85]:
# Create Shakespeare database
cursor = dbserver.cursor()
try:
    cursor.execute('CREATE DATABASE shakespeare')
except:
    cursor.execute('DROP DATABASE shakespeare')
    cursor.execute('CREATE DATABASE shakespeare')

Then, I define the connection string for `SQLAlchemy`’s `create_engine()` function. This string includes the database management system (PostgreSQL), the connector (psycopg), user credentials, and the host and port information.

In [86]:
# upload shakespeare dataframes to shakespeare database
dbms = 'postgresql'
connector = 'psycopg'
user = 'postgres'
password = postgres_password
host = 'localhost'
port = '5432'
database = 'shakespeare'
engine_string = f'{dbms}+{connector}://{user}:{password}@{host}:{port}/{database}'

Using `SQLAlchemy`’s `create_engine()` function, I create an engine for the database connection. I then upload each of the four DataFrames (works, characters, chapters, and paragraphs) to their respective tables in the database. The `to_sql()` method from pandas is used to perform this task, specifying the table name, connection, chunk size, and ensuring that existing tables are replaced.

In [87]:
engine = create_engine(engine_string)

In [88]:
works.to_sql('works', con=engine, chunksize=1000, if_exists='replace', index=False)
characters.to_sql('characters', con=engine, chunksize=1000, if_exists='replace', index=False)
chapters.to_sql('chapters', con=engine, chunksize=1000, if_exists='replace', index=False)
paragraphs.to_sql('paragraphs', con=engine, chunksize=1000, if_exists='replace', index=False)

-36

#### Part b
Write a query to display `title`, `date`, and `totalwords` from the `works` table. Rename `date` to `year`, and sort the output by `totalwords` in descending order. Also create a new column called `era` which is equal to "early" for works created before 1600, "middle" for works created between 1600 and 1607, and "late" for works created after 1607. Finally, display only the 7th through 11th rows of the output data. [1 point]

In `myquery` I select the `title`, `date`, and `totalwords` columns from the `works` table. The `date` column is renamed to `year`.

Then, I create a new column named `era` based on the date column:
* If the date is before 1600, era is set to "early".
* If the date is between 1600 and 1607 (inclusive), era is set to "middle".
* If the date is after 1607, era is set to "late".
This is achieved using the SQL CASE statement.

The results are sorted by the `totalwords` column in **descending** order to listing works with the highest word counts.

Lastly, to display only the 7th through 11th rows of the sorted data, I used the LIMIT and OFFSET clauses:
* OFFSET 6 skips the first 6 rows.
* LIMIT 5 ensures that only the next 5 rows (7th through 11th) are returned.

In [89]:
myquery = '''
SELECT title, date AS year, totalwords,
    CASE 
        WHEN date < 1600 THEN 'early'
        WHEN date > 1600 AND date < 1607 THEN 'middle'
        ELSE 'late'
    END AS era
FROM works
ORDER BY totalwords DESC
LIMIT 5 OFFSET 6;
'''
pd.read_sql_query(myquery, con=engine)

                  title  year  totalwords     era
0             King Lear  1605       26119  middle
1  Troilus and Cressida  1601       26089  middle
2     Henry IV, Part II  1597       25692   early
3     Henry VI, Part II  1590       25411   early
4     The Winter's Tale  1610       24914    late

#### Part c
The `genretype` column in the "works" table designates five types of Shakespearean work:

* `t` is a tragedy, such as *Romeo and Juliet* and *Hamlet*
* `c` is a comedy, such as *A Midsummer Night's Dream* and *As You Like It*
* `h` is a history, such as *Henry V* and *Richard III*
* `s` refers to Shakespeare's sonnets
* `p` is a narrative (non-sonnet) poem, such as *Venus and Adonis* and *Passionate Pilgrim*

Write a query that generates a table that reports the average number of words in Shakepeare's works by genre type. Display the genre type and the average wordcount within genre, use appropriate aliases, and sort by the average in descending order. [1 point]

Breakdown of `myquery`:

1. **SELECT Clause**:
   - `w.genretype`: Selects the `genretype` column from the `works` table.
   - `ROUND(AVG(totalwords), 2) AS avg_words`: Calculates the average of the `totalwords` column, rounds it to 2 decimal places, and renames the result as `avg_words`.

2. **FROM Clause**:
   - `FROM works w`: Specifies the `works` table and assigns it the alias `w`.

3. **GROUP BY Clause**:
   - `GROUP BY w.genretype`: Groups the results by the `genretype` column.

4. **ORDER BY Clause**:
   - `ORDER BY avg_words DESC`: Orders the results by `avg_words` in descending order.

In [90]:
myquery = '''
SELECT w.genretype,
    ROUND(AVG(totalwords),2) AS avg_words
FROM works w
GROUP BY w.genretype
ORDER BY avg_words DESC;
'''
pd.read_sql_query(myquery, con=engine)

  genretype  avg_words
0         h   24236.00
1         t   23817.36
2         c   20212.07
3         s   17515.00
4         p    6181.80

#### Part d
Use a query to generate a table that contains the text of Hamlet's (the character, not just the play) longest speech, and use the `print()` function to display this text. [1 point]

Breakdown of `myquery`:

1. **SELECT Clause**:
   - `p.paragraphnum`: Selects the `paragraphnum` column from the `paragraphs` table. This represents the number of each paragraph or line of text.
   - `string_agg(REPLACE(p.plaintext, '[p]', ''), ' ') AS speech_text`: Aggregates (`string_agg`) the text from the `plaintext` column of the `paragraphs` table into a single string, separated by spaces. It also removes any `[p]` markers using `REPLACE`, and renames this concatenated text as `speech_text`.

2. **FROM Clause**:
   - `FROM paragraphs p`: Specifies the `paragraphs` table as the source of the data and assigns it the alias `p`.

3. **JOIN Clauses**:
   - `JOIN characters c ON p.charid = c.charid`: Joins the `characters` table with the `paragraphs` table using the `charid` column. This ensures that only paragraphs spoken by characters are included.
   - `JOIN works w ON p.workid = w.workid`: Joins the `works` table with the `paragraphs` table using the `workid` column. This ensures that only paragraphs from specific works are included.

4. **WHERE Clause**:
   - `WHERE w.title = 'Hamlet' AND c.charname = 'Hamlet'`: Filters the results to include only those where the work title is 'Hamlet' and the character name is 'Hamlet'. This selects only Hamlet's speeches from the play *Hamlet*.

5. **GROUP BY Clause**:
   - `GROUP BY p.paragraphnum`: Groups the results by the `paragraphnum`, ensuring that the aggregation is performed separately for each paragraph number.

6. **ORDER BY Clause**:
   - `ORDER BY LENGTH(string_agg(REPLACE(p.plaintext, '[p]', ''), ' ')) DESC`: Orders the grouped results by the length of the aggregated speech text in descending order. This ensures that the longest speech appears first.

7. **LIMIT Clause**:
   - `LIMIT 1`: Limits the results to only the longest speech, i.e., the single longest concatenated speech text from Hamlet.

In [91]:
myquery = '''
SELECT p.paragraphnum, string_agg(REPLACE(p.plaintext, '[p]', ''), ' ') AS speech_text
FROM paragraphs p
JOIN characters c ON p.charid = c.charid
JOIN works w ON p.workid = w.workid
WHERE w.title = 'Hamlet' AND c.charname = 'Hamlet'
GROUP BY p.paragraphnum
ORDER BY LENGTH(string_agg(REPLACE(p.plaintext, '[p]', ''), ' ')) DESC
LIMIT 1;
'''

df = pd.read_sql_query(myquery, con=engine)

# Display the longest speech
print(df['speech_text'].iloc[0])

Ay, so, God b' wi' ye!                        [Exeunt Rosencrantz and Guildenstern
Now I am alone.
O what a rogue and peasant slave am I!
Is it not monstrous that this player here,
But in a fiction, in a dream of passion,
Could force his soul so to his own conceit
That, from her working, all his visage wann'd,
Tears in his eyes, distraction in's aspect,
A broken voice, and his whole function suiting
With forms to his conceit? And all for nothing!
For Hecuba!
What's Hecuba to him, or he to Hecuba,
That he should weep for her? What would he do,
Had he the motive and the cue for passion
That I have? He would drown the stage with tears
And cleave the general ear with horrid speech;
Make mad the guilty and appal the free,
Confound the ignorant, and amaze indeed
The very faculties of eyes and ears.
Yet I,
A dull and muddy-mettled rascal, peak
Like John-a-dreams, unpregnant of my cause,
And can say nothing! No, not for a king,
Upon whose property and most dear life
A damn'd defeat was made. Am I a coward?
Who calls me villain? breaks my pate across?
Plucks off my beard and blows it in my face?
Tweaks me by th' nose? gives me the lie i' th' throat
As deep as to the lungs? Who does me this, ha?
'Swounds, I should take it! for it cannot be
But I am pigeon-liver'd and lack gall
To make oppression bitter, or ere this
I should have fatted all the region kites
With this slave's offal. Bloody bawdy villain!
Remorseless, treacherous, lecherous, kindless villain!
O, vengeance!
Why, what an ass am I! This is most brave,
That I, the son of a dear father murther'd,
Prompted to my revenge by heaven and hell,
Must (like a whore) unpack my heart with words
And fall a-cursing like a very drab,
A scullion!
Fie upon't! foh! About, my brain! Hum, I have heard
That guilty creatures, sitting at a play,
Have by the very cunning of the scene
Been struck so to the soul that presently
They have proclaim'd their malefactions;
For murther, though it have no tongue, will speak
With most miraculous organ, I'll have these Players
Play something like the murther of my father
Before mine uncle. I'll observe his looks;
I'll tent him to the quick. If he but blench,
I know my course. The spirit that I have seen
May be a devil; and the devil hath power
T' assume a pleasing shape; yea, and perhaps
Out of my weakness and my melancholy,
As he is very potent with such spirits,
Abuses me to damn me. I'll have grounds
More relative than this. The play's the thing
Wherein I'll catch the conscience of the King. Exit.

### Part e
Many scenes in Shakespeare's works take place in palaces or castles. Use a query to create a table that lists all of the chapters that take place in a palace. Include the work's title, the section (renamed to "act"), the chapter (renamed to "scene"), and the description of these chapters. The setting of each scene is listed in the `description` column of the "chapters" table. [Hint: be sure to account for case sensitivity] [2 points]

Breakdown of `myquery`:

1. **SELECT Clause**:
   - `w.title`: Selects the `title` column from the `works` table, providing the title of the work.
   - `ch.section AS act`: Selects the `section` column from the `chapters` table and renames it as `act`.
   - `ch.chapter AS scene`: Selects the `chapter` column from the `chapters` table and renames it as `scene`.
   - `ch.description`: Selects the `description` column from the `chapters` table.

2. **FROM Clause**:
   - `FROM chapters ch`: Specifies the `chapters` table as the main table for the query and assigns it the alias `ch`.

3. **JOIN Clause**:
   - `JOIN works w ON ch.workid = w.workid`: Joins the `works` table with the `chapters` table using the `workid` column. This ensures that each chapter is associated with its respective work. The `works` table is given the alias `w`.

4. **WHERE Clause**:
   - `WHERE ch.description ILIKE '%%palace%%'`: Filters the results to include only those rows where the `description` column from the `chapters` table contains the substring 'palace'. The `ILIKE` operator performs a case-insensitive search, and the `%` symbols act as wildcards to match any sequence of characters before and after 'palace'.

In [92]:
myquery = '''
SELECT w.title, ch.section AS act, ch.chapter AS scene, ch.description
FROM chapters ch
JOIN works w ON ch.workid = w.workid
WHERE ch.description ILIKE '%%palace%%'; 
'''
pd.read_sql_query(myquery, con=engine)

                         title  act  scene                        description
0                Twelfth Night  1.0    1.0              DUKE ORSINO's palace.
1                Twelfth Night  1.0    4.0              DUKE ORSINO's palace.
2                Twelfth Night  2.0    4.0              DUKE ORSINO's palace.
3    All's Well That Ends Well  1.0    1.0     Rousillon. The COUNT's palace.
4    All's Well That Ends Well  1.0    2.0          Paris. The KING's palace.
..                         ...  ...    ...                                ...
120          The Winter's Tale  2.0    1.0         A room in LEONTES' palace.
121          The Winter's Tale  2.0    3.0         A room in LEONTES' palace.
122          The Winter's Tale  4.0    2.0  Bohemia. The palace of POLIXENES.
123          The Winter's Tale  5.0    1.0         A room in LEONTES' palace.
124          The Winter's Tale  5.0    2.0            Before LEONTES' palace.

[125 rows x 4 columns]

### Part f
Create a table that lists characters, the plays that the characters appear in, the number of speeches the character gives, and the average length of the speeches that the character gives. Display the character description and the work title, not the ID values. Sort the table by average speech length, and restrict the table to only those characters that give at least 20 speeches. [Hint: you will need to use a subquery.] [2 points]

The subquery calculates the average speech length for each character and filters out characters with fewer than 20 speeches.
Here's the breakdown for the `subquery`:
Sure, here's a breakdown of the queries you used for task part f:

1. **SELECT Clause:**
   - `c.charname`: Selects the name of the character.
   - `c.charid`: Selects the character ID.
   - `w.workid`: Selects the work ID.
   - `c.speechcount`: Selects the count of speeches by the character.
   - `AVG(p.wordcount) AS avg_speech_length`: Calculates the average length of the speeches by the character.

2. **FROM Clause:**
   - `FROM characters c`: Specifies the `characters` table and assigns it the alias `c`.

3. **JOIN Clauses:**
   - `JOIN paragraphs p ON c.charid = p.charid`: Joins the `paragraphs` table on the character ID.
   - `JOIN works w ON c.works = w.workid`: Joins the `works` table on the work ID.

4. **GROUP BY Clause:**
   - `GROUP BY c.charname, c.charid, w.workid, c.speechcount`: Groups the results by character name, character ID, work ID, and speech count.

5. **HAVING Clause:**
   - `HAVING COUNT(p.paragraphnum) >= 20`: Filters the results to include only those characters that have given at least 20 speeches.
   - 
I will use IDs (charid and workid) to join back to the characters and works tables in the main query to retrieve detailed descriptive data (like character descriptions and work titles) which are not included in the subquery.

In [93]:
subquery = '''
SELECT c.charname, c.charid, w.workid, c.speechcount,
    AVG(p.wordcount) AS avg_speech_length
FROM characters c
JOIN paragraphs p ON c.charid = p.charid
JOIN works w ON c.works = w.workid
GROUP BY c.charname, c.charid, w.workid, c.speechcount
HAVING COUNT(p.paragraphnum) >= 20
'''
pd.read_sql_query(subquery, con=engine)

      charname         charid        workid  speechcount  avg_speech_length
0        Aaron          Aaron         titus         57.0          49.719298
1     Achilles       Achilles       troilus         74.0          17.824324
2      Adriana        ADRIANA  comedyerrors         79.0          26.772152
3       Aeneas         Aeneas       troilus         44.0          23.818182
4    Agamemnon      Agamemnon       troilus         52.0          26.461538
..         ...            ...           ...          ...                ...
338      Viola          VIOLA       12night        121.0          21.247934
339   Virgilia       virgilia    coriolanus         26.0           8.923077
340   Volumnia       volumnia    coriolanus         57.0          42.754386
341      Widow  WidowFlorence      allswell         21.0          21.380952
342   Williams       Williams        henry5         28.0          22.035714

[343 rows x 5 columns]

The main query, `myquery`, selects the character name, work title, character description, speech count, and average speech length from the subquery. The results are ordered by average speech length in descending order.

Here's the breakdown:

1. **SELECT Clause:**
   - `c.charname`: Selects the name of the character.
   - `w.title`: Selects the title of the work.
   - `c.description`: Selects the description of the character.
   - `subq.speechcount`: Selects the count of speeches from the subquery.
   - `subq.avg_speech_length`: Selects the average speech length from the subquery.

2. **FROM Clause:**
   - `FROM ({subquery}) subq`: Uses the subquery as a derived table and assigns it the alias `subq`.

3. **JOIN Clauses:**
   - `JOIN characters c ON subq.charid = c.charid`: Joins the `characters` table on the character ID.
   - `JOIN works w ON subq.workid = w.workid`: Joins the `works` table on the work ID.

4. **ORDER BY Clause:**
   - `ORDER BY subq.avg_speech_length DESC`: Orders the results by average speech length in descending order.

In [94]:
myquery = f'''
SELECT c.charname, w.title, c.description, subq.speechcount, subq.avg_speech_length
FROM ({subquery}) subq
JOIN characters c ON subq.charid = c.charid
JOIN works w ON subq.workid = w.workid
ORDER BY subq.avg_speech_length DESC
'''

pd.read_sql_query(myquery, con=engine)

,charname,title,description,speechcount,avg_speech_length
0,King Richard II,Richard II,king of England,98.0,61.765306
1,Queen Katharine,Henry VIII,"wife to King Henry, afterwards divorced",50.0,59.360000
2,Constance,King John,mother to Arthur,36.0,59.222222
3,Duke of Buckingham,Henry VIII,None,26.0,57.307692
4,Oberon,Midsummer Night's Dream,king of the fairies,29.0,55.655172
...,...,...,...,...,...
338,First Murderer,Macbeth,None,21.0,8.666667
339,Curtis,Taming of the Shrew,None,20.0,8.550000
340,Lucius,Julius Caesar,servant to Brutus,24.0,8.541667
341,Alice,Henry V,a lady attending on Princess Katherine,22.0,7.454545
342,(stage directions),As You Like It,None,126.0,4.309517

### Part g
Which Shakepearean works do not contain any scenes in a palace or a castle? Use a query that displays the title, genre type, and publication date of works that do not contain any scenes that take place in a palace or castle. [Hint: use your work in part e as a starting point. You will need a subquery, and you will need to think carefully about the type of join that you need to perform.][2 points]

The `subquery` is used to first identify all works that have any scenes described with the terms "palace" or "castle." This subquery fetches the unique IDs (`workid`) of works that contain scenes described with "palace" or "castle." Here's the breakdown:

#### 1. SELECT Clause
- **`SELECT DISTINCT w.workid`**
  - **`DISTINCT`**: Ensures that the output contains only unique values. This is important because multiple chapters (scenes) within the same work might mention "palace" or "castle," but you only want each work to be represented once in the results.
  - **`w.workid`**: This is the unique identifier for each work.

#### 2. FROM Clause
- **`FROM chapters ch`**
  - This clause specifies that the data is being retrieved from the `chapters` table. The table is aliased as `ch`.

#### 3. JOIN Clause
- **`JOIN works w ON ch.workid = w.workid`**
  - This joins the `chapters` table to the `works` table based on their common `workid`.
  - **`works w`**: The `works` table is aliased as `w`.
  - **`ON ch.workid = w.workid`**: Ensures that the join condition matches chapters to their corresponding works based on the work ID, which should be a common key in both tables.

#### 4. WHERE Clause
- **`WHERE ch.description ILIKE '%%palace%%' OR ch.description ILIKE '%%castle%%'`**
  - This condition filters the chapters to include only those whose descriptions contain the keywords "palace" or "castle". The query uses the `ILIKE` operator for case-insensitive matching, which is important for ensuring that variations in capitalization do not affect the search results.
  - **`ILIKE`**: A PostgreSQL operator that performs case-insensitive pattern matching.
  - **`'%%palace%%'` and `'%%castle%%'`**: These patterns use wildcard characters (`%`) to find any occurrences of the words "palace" and "castle" anywhere in the chapter descriptions.

The purpose of this subquery is to create a list of work IDs (`workid`) for works that contain references to palaces or castles in any of their chapters. This list is used in the main query to exclude these works.

In [95]:
subquery = '''
SELECT DISTINCT w.workid
FROM chapters ch
JOIN works w ON ch.workid = w.workid
WHERE ch.description ILIKE '%%palace%%' OR ch.description ILIKE '%%castle%%'
'''
pd.read_sql_query(subquery, con=engine)

          workid
0        measure
1       allswell
2       kingjohn
3       richard2
4       richard3
5        othello
6       henry6p1
7       henry6p3
8        12night
9    winterstale
10  comedyerrors
11       troilus
12      pericles
13        hamlet
14      henry4p2
15    antonycleo
16     midsummer
17   asyoulikeit
18      henry4p1
19       macbeth
20      twogents
21      kinglear
22         titus
23        henry8
24        henry5
25     cymbeline
26      henry6p2

The following main query `myquery` uses the result ofr the subquery to filter works that do not have scenes taking place in a 'palace' or 'castle'. Here's the breakdown:

#### 1. SELECT Clause
- **`SELECT w.title, w.genretype, w.date`**
  - This part of the query specifies the columns to be retrieved from the `works` table:
    - **`w.title`**: The title of the work.
    - **`w.genretype`**: The genre of the work.
    - **`w.date`**: The publication date of the work.

#### 2. FROM Clause
- **`FROM works w`**
  - This clause indicates that the data is being fetched from the `works` table, which is aliased as `w`.

#### 3. LEFT JOIN Clause
- **`LEFT JOIN ({subquery}) AS subq ON subq.workid = w.workid`**
  - This is a `LEFT JOIN` operation that incorporates the results of the subquery as a derived table, aliased as `subq`.
  - **`({subquery}) AS subq`**: The subquery is included directly within parentheses to ensure it is treated as a separate table. This subquery is designed to identify works that have scenes described with "palace" or "castle".
  - **`ON subq.workid = w.workid`**: This condition specifies how the join should be performed. It matches the `workid` from the subquery results with the `workid` in the main `works` table.
  
#### 4. WHERE Clause
- **`WHERE subq.workid IS NULL`**
  - This condition is what filters the results to include only those works that do not have scenes set in a 'palace' or 'castle'. When the `LEFT JOIN` finds no matching `workid` in the subquery for a given record in the `works` table, the fields from the subquery (`subq`) will be `NULL`.

In [96]:
myquery = f'''
SELECT w.title, w.genretype, w.date
FROM works w
LEFT JOIN ({subquery}) AS subq ON subq.workid = w.workid
WHERE subq.workid IS NULL
'''
pd.read_sql_query(myquery, con=engine)

                     title genretype  date
0               Coriolanus         t  1607
1            Julius Caesar         t  1599
2        Lover's Complaint         p  1609
3     Love's Labour's Lost         c  1594
4       Merchant of Venice         c  1596
5   Merry Wives of Windsor         c  1600
6   Much Ado about Nothing         c  1598
7       Passionate Pilgrim         p  1598
8   Phoenix and the Turtle         p  1601
9          Rape of Lucrece         p  1594
10        Romeo and Juliet         t  1594
11                 Sonnets         s  1609
12     Taming of the Shrew         c  1593
13                 Tempest         c  1611
14         Timon of Athens         t  1607
15        Venus and Adonis         p  1593

### Problem 2
The following file contains JSON formatted data of the official English-language translations of every constitution currently in effect in the world:

In [97]:
const = requests.get("https://github.com/jkropko/DS-6001/raw/master/localdata/const.json")
const_json = json.loads(const.text)
pd.DataFrame.from_records(const_json)

,text,country,adopted,revised,reinstated,democracy
0,'Afghanistan 2004 Preamble \n﻿In the na...,Afghanistan,2004,NaN,NaN,0.372201
1,'Albania 1998 (rev. 2012) Preamble \nWe...,Albania,1998,2012.0,NaN,0.535111
2,'Andorra 1993 Preamble \nThe Andorran P...,Andorra,1993,NaN,NaN,NaN
3,"'Angola 2010 Preamble \nWe, the people ...",Angola,2010,NaN,NaN,0.315043
4,'Antigua and Barbuda 1981 Preamble \nWH...,Antigua and Barbuda,1981,NaN,NaN,NaN
...,...,...,...,...,...,...
140,'Uzbekistan 1992 (rev. 2011) Preamble \...,Uzbekistan,1992,2011.0,NaN,0.195932
141,'Viet Nam 1992 (rev. 2013) Preamble \nI...,Viet Nam,1992,2013.0,NaN,0.251461
142,'Yemen 1991 (rev. 2001) PART ONE. THE FOUN...,Yemen,1991,2001.0,NaN,0.125708
143,"'Zambia 1991 (rev. 2009) Preamble \nWE,...",Zambia,1991,2009.0,NaN,0.405497
144,'Zimbabwe 2013 Preamble \nWe the people...,Zimbabwe,2013,NaN,NaN,0.315359

The text of the constitutions are available from the [Wolfram Data Repository](https://datarepository.wolframcloud.com/resources/World-Constitutions). I also included scores that represent the level of democractic quality in each country as of 2016. These scores are compiled by the [Varieties of Democracy (V-Dem)](https://www.v-dem.net/en/) project. Higher scores indicate greater levels of democratic openness and competition.

#### Part a
Connect to your local MongoDB server and create a new collection for the constitution data. Use `.delete_many({})` to remove any existing data from this collection, and insert the data in `const_json` into this collection. [2 points]

I have MongoDB server up and running in my docker container and I've imported the `pymongo` library in the beginning of this notebook. 

First, I am constructing the `mongo_uri` using the environemnt variables loaded form my `.env` file in this format `mongodb://username:password@host:port/database?authSource=admin`. Then, to access the local MongoDB server, I am using `.MongoClient()` method and passing `mongo_uri`:

In [98]:
MONGO_INITDB_ROOT_USERNAME = os.getenv('MONGO_INITDB_ROOT_USERNAME')
MONGO_INITDB_ROOT_PASSWORD = os.getenv('MONGO_INITDB_ROOT_PASSWORD')
mongo_init_db = os.getenv('mongo_init_db')

In [99]:
# Create the connection URI
mongo_uri = f"mongodb://{MONGO_INITDB_ROOT_USERNAME}:{MONGO_INITDB_ROOT_PASSWORD}@localhost:27017/{mongo_init_db}?authSource=admin"

# Create the MongoClient
myclient = pymongo.MongoClient(mongo_uri)

To create a database on this server, I am passing a string element to `myclient` with the name of the database I want to create:

In [100]:
constdb = myclient["const"]

Here, I am setting up a new collection named "constcollection" on the MongoDB server:

In [101]:
try:
    constcol = constdb["constcollection"]
except:
    # check if this collection already exists in the "constdb" database
    collist = constdb.list_collection_names()
    if "constcollection" in collist:
        # if so, drop this collection before creating a new
        constdb.todaycol.drop()
    constcol = constdb["constcollection"]

Using `.delete_many({})` to remove any existing data from this collection:

In [102]:
constcol.delete_many({})

DeleteResult({'n': 145, 'ok': 1.0}, acknowledged=True)

To insert **all** the records in `const_json` (which is already in JSON format) into this collection, I am using the `.insert_many()` method applied to `constcol` and passing `const_json`:

In [103]:
constdata = constcol.insert_many(const_json)
constcol.count_documents({}) # confirming the number of records

145

#### Part b
Use MongoDB queries and the `dumps()` and `loads()` functions from the `bson` package to produce dataframes with the following restrictions:

* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 
* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 AND have a democracy score of less than 0.5
* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 OR have a democracy score of less than 0.5

[1 point]

First, I import `dumps` and `loads` from the `bson.json_util` package:

In [104]:
from bson.json_util import dumps, loads

**MongoDB Query**:

I am using the `find()` method on the MongoDB collection `constcol` to filter documents where the 'adopted' field is greater than 1990. Then, only extract 'country', 'adopted', and 'democracy' fields. Also, I explicitly excluded '_id' field by setting it to 0.

To place all the query result into a dataframe, I pass the query output `cursor` to `dumps()`, which converts the query output to plain text. Next I pass this text to `loads()`, which registers the text as a list of JSON dictionaries. Finally, I use this list as the argument of `pd.DataFrame.from_records()` to convert the output to a dataframe then display the datframe.

In [105]:
cursor = constcol.find({'adopted': {'$gt': 1990}}, 
                       {'country': 1,
                        'adopted': 1,
                        'democracy': 1,
                        '_id': 0})
qtext = dumps(cursor)
qrec = loads(qtext)
df1 =pd.DataFrame.from_records(qrec)
df1

        country  adopted  democracy
0   Afghanistan     2004   0.372201
1       Albania     1998   0.535111
2       Andorra     1993        NaN
3        Angola     2010   0.315043
4       Armenia     1995   0.393278
..          ...      ...        ...
66   Uzbekistan     1992   0.195932
67     Viet Nam     1992   0.251461
68        Yemen     1991   0.125708
69       Zambia     1991   0.405497
70     Zimbabwe     2013   0.315359

[71 rows x 3 columns]

Here, I am using the `find()` method on the MongoDB collection `constcol` to filter documents where the 'adopted' field is greater than 1990 AND the democracy score is less than 0.5. Then, only extract 'country', 'adopted', and 'democracy' fields. Also, I explicitly excluded '_id' field by setting it to 0.

To place all the query result into a dataframe, I pass the query output `cursor` to `dumps()`, which converts the query output to plain text. Next I pass this text to `loads()`, which registers the text as a list of JSON dictionaries. Finally, I use this list as the argument of `pd.DataFrame.from_records()` to convert the output to a dataframe then display the datframe.

In [106]:
cursor = constcol.find({'adopted': {'$gt': 1990}, 'democracy': {'$lt': 0.5}}, 
                       {'country': 1,
                        'adopted': 1,
                        'democracy': 1,
                        '_id': 0})
qtext = dumps(cursor)
qrec = loads(qtext)
df2 =pd.DataFrame.from_records(qrec)
df2

                             country  adopted  democracy
0                        Afghanistan     2004   0.372201
1                             Angola     2010   0.315043
2                            Armenia     1995   0.393278
3                            Belarus     1994   0.289968
4             Bosnia and Herzegovina     1995   0.338267
5                           Cambodia     1993   0.313738
6                              Egypt     2014   0.218600
7                  Equatorial Guinea     1991   0.217861
8                            Eritrea     1997   0.075621
9                           Ethiopia     1994   0.254865
10                              Fiji     2013   0.473559
11                            Gambia     1996   0.348132
12                              Iraq     2005   0.455402
13                        Kazakhstan     1995   0.262596
14  Lao People's Democratic Republic     1991   0.094434
15                             Libya     2011   0.294716
16                          Maldives     2008   0.386754
17                        Montenegro     2007   0.455338
18                           Myanmar     2008   0.405772
19                              Oman     1996   0.191211
20                Russian Federation     1993   0.275516
21                            Rwanda     2003   0.274476
22                      Saudi Arabia     1992   0.024049
23                            Serbia     2006   0.474443
24                           Somalia     2012   0.177772
25                       South Sudan     2011   0.183267
26                             Sudan     2005   0.311799
27                         Swaziland     2005   0.136008
28              Syrian Arab Republic     2012   0.148212
29                      Turkmenistan     2008   0.154887
30                            Uganda     1995   0.338308
31                           Ukraine     1996   0.361911
32                        Uzbekistan     1992   0.195932
33                          Viet Nam     1992   0.251461
34                             Yemen     1991   0.125708
35                            Zambia     1991   0.405497
36                          Zimbabwe     2013   0.315359

Here, I am using the `find()` method on the MongoDB collection `constcol` to filter documents where the 'adopted' field is greater than 1990 OR the democracy score is less than 0.5. Then, only extract 'country', 'adopted', and 'democracy' fields. Also, I explicitly excluded '_id' field by setting it to 0.

To place all the query result into a dataframe, I pass the query output `cursor` to `dumps()`, which converts the query output to plain text. Next I pass this text to `loads()`, which registers the text as a list of JSON dictionaries. Finally, I use this list as the argument of `pd.DataFrame.from_records()` to convert the output to a dataframe then display the datframe.

In [107]:
cursor = constcol.find({'$or': [{'adopted': {'$gt': 1990}}, {'democracy': {'$lt': 0.5}}]}, 
                       {'country': 1,
                        'adopted': 1,
                        'democracy': 1,
                        '_id': 0})
qtext = dumps(cursor)
qrec = loads(qtext)
df3 =pd.DataFrame.from_records(qrec)
df3

        country  adopted  democracy
0   Afghanistan     2004   0.372201
1       Albania     1998   0.535111
2       Andorra     1993        NaN
3        Angola     2010   0.315043
4       Armenia     1995   0.393278
..          ...      ...        ...
78   Uzbekistan     1992   0.195932
79     Viet Nam     1992   0.251461
80        Yemen     1991   0.125708
81       Zambia     1991   0.405497
82     Zimbabwe     2013   0.315359

[83 rows x 3 columns]

#### Part c
According to the Varieties of Democracy project, [Hungary has become less democratic](https://www.v-dem.net/en/news/democratic-declines-hungary/) over the last few years, and can no longer be considered a democracy. Update the record for Hungary to set the democracy score at 0.4. Then query the database to extract the record for Hungary and display the data in a dataframe. [1 point]

First, I am using the `mongo_read_query()` function from the textbook, to quickly see the output of queries in a dataframe. The function takes a JSON dictionary as an input, and outputs a pandas dataframe:

In [108]:
def mongo_read_query(col, q):
    qtext = dumps(col.find(q))
    qrec = loads(qtext)
    qdf = pd.DataFrame.from_records(qrec)
    return qdf

### Hungary *before* the update
To look at the score value for Hungary before I updated the value, I am defining a query to look for rows where country is equal to Hungary and displaying the result to the query using the function above:

In [109]:
hungaryquery = {'country': 'Hungary'}
mongo_read_query(constcol, hungaryquery)

,_id,text,country,adopted,revised,reinstated,democracy
0,66a025f38a79922c03b83a61,'Hungary 2011 (rev. 2013) Preamble \nGo...,Hungary,2011,2013.0,None,0.697058

### Hungary *after* the update
Now, to update the record for hungary's deocracy score, I am using the `update_one()` method applied to `constcol` the collection. Passing the first argument as the logical condtion that identifies the recod I want to edit. Then, for the second argument, I use `$set` operator to choose specific fields within the JSON record to change. In this case, it's `democracy` and changing it to 0.4. Lastly, I am using the `mongo_read_query()` to query the Hungary record and check if the update is reflected.

In [110]:
constcol.update_one(hungaryquery, {'$set' : {'democracy': 0.4}})
mongo_read_query(constcol, hungaryquery)

,_id,text,country,adopted,revised,reinstated,democracy
0,66a025f38a79922c03b83a61,'Hungary 2011 (rev. 2013) Preamble \nGo...,Hungary,2011,2013.0,None,0.4

#### Part d
Set the `text` field in the database as a text index. Then query the database to find all constitutions that contain the exact phrase "freedom of speech". Display the country name, adoption year, and democracy scores in a dataframe for the constitutions that match this query. [2 points]

To create a text index for the 'text' field as a text idex in the `constco` constitution collection:

In [111]:
constcol.create_index([('text', 'text')])

'text_text'

To query the database to find all constitutions that contain the exact phrase "freedom of speech", I will first construct a query using the `$text` operator with the search term along with 'country', 'adopted', and 'democracy' fields and use it within a call to `.find()`:

In [112]:
cursor = constcol.find({'$text': {'$search': 'freedom of speech', '$caseSensitive': False}}, 
                       {'country': 1,
                        'adopted': 1,
                        'democracy': 1,
                        '_id': 0})
qtext = dumps(cursor)
qrec = loads(qtext)
search_df =pd.DataFrame.from_records(qrec)
search_df

                      country  adopted  democracy
0                Turkmenistan     2008   0.154887
1                      Sweden     1974   0.902575
2                    Slovenia     1991   0.861380
3                      Poland     1997   0.682208
4      Bosnia and Herzegovina     1995   0.338267
..                        ...      ...        ...
140               Netherlands     1815   0.859255
141                   Denmark     1953   0.883552
142  United States of America     1789   0.849155
143                 Australia     1901   0.879540
144         Brunei Darussalam     1959        NaN

[145 rows x 3 columns]

#### Part e
Use a query to search for the terms "freedom", "liberty", "legal", "justice", and "rights". Generate a text score for all of the countries, and display the data for the countries with the top 10 relevancy scores in a dataframe. [2 points]

Here I query the database with five search terms, "freedom", "liberty", "legal", "justice", and "rights". Then, to rank countires by search-relevancy, I add `{'score': {'$meta': 'textScore'}}` to the query I pass to the `.find()` method.

In [113]:
cursor = constcol.find({'$text': {'$search': 'freedom liberty legal justice rights', '$caseSensitive': False}},
                       {'score': {'$meta': 'textScore'},
                        'country': 1,
                        'adopted': 1,
                        'democracy': 1,
                        '_id': 0})

Next I apply the `.sort()` method to the output, arranging the results by relevancy score:

In [114]:
cursor.sort([('score', {'$meta': 'textScore'})])

Then, I apply `.limit(10)` to the output to limit the output to the top 10 relevanct scores:

In [115]:
cursor.limit(10)

Converting the output to a dataframe with the following code:

In [116]:
qtext = dumps(cursor)
qrec = loads(qtext)
search_df1 =pd.DataFrame.from_records(qrec)
search_df1

                 country  adopted  democracy     score
0                 Serbia     2006   0.474443  5.030999
1                Finland     1999   0.856265  5.029000
2                Estonia     1992   0.909233  5.024473
3                Armenia     1995   0.393278  5.023651
4                Albania     1998   0.535111  5.023087
5     Dominican Republic     2015   0.583654  5.019910
6  Moldova (Republic of)     1994   0.571357  5.017063
7            El Salvador     1983   0.661989  5.016899
8                Georgia     1995   0.757486  5.015282
9                 Turkey     1982   0.341745  5.014672

### Question 3
Close the connections to the PostgreSQL and MongoDB databases. [1 point]

In [117]:
# PostgresSQL
dbserver.commit()
dbserver.close()

# MongoDB
myclient.close()